Repository: FabianVarela/flutter_login_types
Catalog: lib/l10n/app_*.arb
Languages: es

# appName
source: Login types
es: Login con Bloc

# signInOptionText
source: Chose sign in options
es: Elige una forma de iniciar sesión

# signInText
source: Sign in with {option}
es: Iniciar sesión con {option}

# signInUserPassword
source: User / password
es: Usuario / contraseña

# signInFingerPrint
source: Fingerprint
es: Huella

# signInThird
source: Third parties
es: Terceros

# emailPlaceholder
source: Enter email
es: Ingrese correo electrónico

# emailRequiredMessage
source: Email is required
es: El correo electrónico es requerido

# passwordPlaceholder
source: Enter password
es: Ingrese la contraseña

# passwordRequiredMessage
source: Password is required
es: La contraseña es requerida

# signInButton
source: Sign In
es: Iniciar sesión

# userPasswordIncorrectMessage
source: User or password incorrect.
es: Usuario o contraseña incorrecta.

# phoneNumberTitle
source: Digit phone number
es: Digite el número de teléfono

# phoneNumberPlaceholder
source: Enter phone number
es: Ingrese número telefónico

# phoneNumberRequired
source: Phone number is required
es: El número de teléfono es requerido

# verifyButtonText
source: Verify
es: Verificar

# passcodeTitle
source: Digit verification code
es: Digite el código de verificación

# phoneNumberIncorrect
source: Phone number is incorrect.
es: Número de teléfono incorrecto.

# passcodeIncorrect
source: Passcode is incorrect.
es: Código incorrecto.

# biometricTitle
source: Click to start
es: Haz click para iniciar

# biometricButtonText
source: Click to start with fingerprint
es: Click para iniciar con huella

# biometricEnabledText
source: You must go to settings and enable fingerprint or face ID
es: Debes ir a configuración y habilitar la huella o el Face ID

# biometricNoSupportedText
source: This device no support sign in by fingerprint
es: Este dispositivo no soporta inicio de sesión mediante biometría

# biometricReason
source: Set fingerprint or face id to start
es: Coloca tu huella o cara para iniciar

# biometricError
source: No authorized
es: No autorizado

# homeTitle
source: Home page
es: Página de inicio

# homeText
source: Welcome
es: Bienvenido

# emptyValidation
source: Text field is empty
es: El campo de texto se encuentra vacío

# emailValidation
source: Enter a valid email
es: Ingrese un correo válido

# passwordValidation
source: The password is greater than 4 characters
es: La contraseña debe ser mayor que 4 caracteres

# numberValidation
source: Enter a valid number
es: Ingrese un número válido

# notificationTitle
source: Login types
es: Inicio de sesión con BloC

# notificationMessage
source: Your code is {code}
es: Tu código es {code}

# changeLanguageTitle
source: Change language
es: Cambiar idioma

# englishLanguage
source: English
es: Inglés

# spanishLanguage
source: Spanish
es: Español

# firebaseSubtitleSignIn
source: Welcome to FlutterFire UI! Please sign in to continue.
es: Bienvenido a FlutterFire UI! Por favor inicie sesión para continuar.

# firebaseSubtitleSignUp
source: Welcome to FlutterFire UI! Please create an account to continue.
es: Bienvenido a FlutterFire UI! Por favor crea una cuenta para continuar.

# firebaseFooterSignIn
source: By signing in, you agree to our terms and conditions.
es: Para iniciar sesión, debes estar de acuerdo con los términos y condiciones.

# firebaseFooterSignUp
source: By signing up, you agree to our terms and conditions.
es: Para registrarse, debes estar de acuerdo con los términos y condiciones.
